# Preprocessing Data
## Dealing with missing values

In [1]:
import numpy as pd
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('data.csv')
data.head()

,Number,City,Colors Reported,Shape Reported,State,Time
0,123456.0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,54321.0,Willingboro,green,NaN,NJ,6/30/1930 20:00
2,87654.0,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,3456.0,Abilene,blue,DISK,KS,1/12/1900 0:00
4,7654.0,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

In [3]:
dupes = data.duplicated()
sum(dupes)

13

In [4]:
data = data.drop_duplicates()

In [5]:
dupes = data.duplicated()
sum(dupes)

0

In [7]:
pd.DataFrame({'value': data['Number'], 'Missing?' : data['Number'].isnull()})

       value  Missing?
0   123456.0     False
1    54321.0     False
2    87654.0     False
3     3456.0     False
4     7654.0     False
5        NaN      True
6    87654.0     False
7     6789.0     False
8        NaN      True
9     4567.0     False
10    7654.0     False
11       NaN      True
12    6543.0     False
13     876.0     False
14    5432.0     False
19    6543.0     False
20     876.0     False
21    5432.0     False

### Non-standard missing values

In [9]:
pd.DataFrame({'value': data["Shape Reported"], 'Missing?' : data['Shape Reported'].isnull()})

       value  Missing?
0   TRIANGLE     False
1        NaN      True
2       OVAL     False
3       DISK     False
4      LIGHT     False
5        NaN      True
6     CIRCLE     False
7       DISK     False
8         12     False
9   CYLINDER     False
10     LIGHT     False
11  FIREBALL     False
12    SPHERE     False
13         @     False
14      DISK     False
19       ???     False
20         @     False
21      DISK     False

### Unexpected missing values

In [10]:
pd.DataFrame({'value':data['State'], 'Missing?' : data['State'].isnull()})

   value  Missing?
0     NY     False
1     NJ     False
2     CO     False
3     KS     False
4     NY     False
5      N     False
6     CA     False
7     MI     False
8     AK     False
9    NaN      True
10    CA     False
11    AL     False
12     Y     False
13    IA     False
14    MI     False
19     Y     False
20    IA     False
21    MI     False

In [12]:
# number of missing values in each attribute
pd.DataFrame(data.isnull().sum(), columns=['Number of missing values'])

                 Number of missing values
Number                                  3
City                                    0
Colors Reported                         9
Shape Reported                          2
State                                   1
Time                                    0

### Any missing values?

In [13]:
data.isnull().values.any()

True

### Total missing values

In [15]:
data.isnull().sum().sum()

15

## Replacing missing values

In [21]:
data['Number'].head(10)

0    123456.0
1     54321.0
2     87654.0
3      3456.0
4      7654.0
5         NaN
6     87654.0
7      6789.0
8         NaN
9      4567.0
Name: Number, dtype: float64

In [22]:
data['Number'].fillna(12345, inplace=True)
data['Number'].head(10)

0    123456.0
1     54321.0
2     87654.0
3      3456.0
4      7654.0
5     12345.0
6     87654.0
7      6789.0
8     12345.0
9      4567.0
Name: Number, dtype: float64

### Dropping rows with missing values

In [23]:
data.isnull().sum()

Number             0
City               0
Colors Reported    9
Shape Reported     2
State              1
Time               0
dtype: int64

In [24]:
data.dropna(inplace=True)
data.isnull().sum()

Number             0
City               0
Colors Reported    0
Shape Reported     0
State              0
Time               0
dtype: int64

In [25]:
data

,Number,City,Colors Reported,Shape Reported,State,Time
3,3456.0,Abilene,blue,DISK,KS,1/12/1900 0:00
6,87654.0,Crater Lake,yellow,CIRCLE,CA,6/15/1935 0:00
8,12345.0,Eklutna,green,12,AK,10/15/1936 17:00
12,6543.0,Belton,red,SPHERE,Y,6/30/1939 20:00
19,6543.0,Belton,red,???,Y,6/30/1939 20:00
20,876.0,Keokuk,not known,@,IA,7/7/1939 2:00
21,5432.0,Ludington,*****,DISK,MI,6/1/1941 13:00

## Dealing with incorrect/unwanted observations

In [27]:
data.tail()

     Number       City Colors Reported Shape Reported State              Time
8   12345.0    Eklutna           green             12    AK  10/15/1936 17:00
12   6543.0     Belton             red         SPHERE     Y   6/30/1939 20:00
19   6543.0     Belton             red            ???     Y   6/30/1939 20:00
20    876.0     Keokuk       not known              @    IA     7/7/1939 2:00
21   5432.0  Ludington           *****           DISK    MI    6/1/1941 13:00

In [29]:
data.shape

(7, 6)

In [31]:
data_filtered = data[data['Colors Reported'] != '*****']
data_filtered

,Number,City,Colors Reported,Shape Reported,State,Time
3,3456.0,Abilene,blue,DISK,KS,1/12/1900 0:00
6,87654.0,Crater Lake,yellow,CIRCLE,CA,6/15/1935 0:00
8,12345.0,Eklutna,green,12,AK,10/15/1936 17:00
12,6543.0,Belton,red,SPHERE,Y,6/30/1939 20:00
19,6543.0,Belton,red,???,Y,6/30/1939 20:00
20,876.0,Keokuk,not known,@,IA,7/7/1939 2:00

In [33]:
data_filtered2 = data.drop(data[data['Shape Reported'] == '@'].index, inplace=False)
data_filtered2

,Number,City,Colors Reported,Shape Reported,State,Time
3,3456.0,Abilene,blue,DISK,KS,1/12/1900 0:00
6,87654.0,Crater Lake,yellow,CIRCLE,CA,6/15/1935 0:00
8,12345.0,Eklutna,green,12,AK,10/15/1936 17:00
12,6543.0,Belton,red,SPHERE,Y,6/30/1939 20:00
19,6543.0,Belton,red,???,Y,6/30/1939 20:00
21,5432.0,Ludington,*****,DISK,MI,6/1/1941 13:00